#1. Роздрукувати всі парні числа менші 100 (написати два варіанти коду: один використовуючи цикл while, а інший з використанням циклу for).
i=0
while i<100:
    print(i)
    i=i+2
 
for i in range(0,100,2):
    print(i) 
#2. Роздрукувати всі непарні числа менші 100. (написати два варіанти коду: один використовуючи оператор continue, а інший без цього оператора).    
i=1
while i<100:
    print(i)
    i=i+2

for i in range(1,100,2):
    print(i) 
#3. Перевірити чи список містить непарні числа.
(Підказка: використати оператор break)
mylist=range(1,100,3)
for i in mylist:
    print(i) 
    z=i%2
    if z==0:
        break
else:
    print("відсутнє парне") 

4. Створити список, який містить елементи цілочисельного типу, потім за допомогою циклу перебору змінити тип даних елементів на числа з плаваючою крапкою. (Підказка: використати вбудовану функцію float ()).
i=0
mylist=list(range(1,100,3))
while i<len(mylist):
    mylist[i]=float(mylist[i])
    i=i+1
print(mylist)


#5. Вивести числа Фібоначі включно до введеного числа n, використовуючи цикли. (Послідовність чисел Фібоначі 0, 1, 1, 2, 3, 5, 8, 13 і т.д.)
i=1
b1=1
b2=0
n=int(input("enter n"))
while i<n:
    
    sum=b1+b2
    print(b1,"-")
    b2=b1
    b1=sum
    
    
    i=i+1
    
    # b1=b1+1

